#include <iostream> 

int main()
{
    double x;
    std::cin >> x;
    std::cout << x / 2.54 << std::endl;
    return 0;
}

//Напишите программу для перевода сантиметров в дюймы.
// В одном дюйме 2.54 сантиметра