#include <iostream>
#include <string>

int main()
{
    std::cout << "C++ is a general-purpose programming language with a bias towards systems programming that\n\n";
    std::cout <<"  - is a better C\n";
    std::cout <<"  - supports data abstraction\n";
    std::cout <<"  - supports object-oriented programming\n";
    std::cout <<"  - supports generic programming.\n";
}

//Напишите программу, печатающую на экране первые строчки со страницы Бьярне Страуструпа про C++